app/channels/application_cable/connection.rb

      def find_verified_user
        verified_user = Shopper.first
---
SELECT "shoppers".* FROM "shoppers" ORDER BY "shoppers"."id" ASC LIMIT $1  [["LIMIT", 1]]