app/controllers/addresses_controller.rb

  def index
    # client = Ignite::Client.new()
    # puts "~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ #{client.query("SELECT name FROM SHOPPERS WHERE id = 3")} ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~"

    @addresses = Address.where(shopper_id: Redis.current.get("shopper_id")).pluck(:id, :name)
---
SELECT "addresses"."id", "addresses"."name" FROM "addresses" WHERE "addresses"."shopper_id" = $1  [["shopper_id", 1]]

    def set_address
      address = Address.where(id: params[:id]).pluck(:id, :name, :detail, :shopper_id)
      if address[0][3] != Redis.current.get("shopper_id").to_i
        flash[:notice] = "You must be the same user as this address."
        redirect_to '/addresses'
      end
      Redis.current.mset("address_id","#{address[0][0]}","address_name","#{address[0][1]}","address_detail","#{address[0][2]}")
      puts "~~~~~~~~~~~~~~~~~~~~~ REDIS SAVED ADDRESS INFO #{address[0][3] }~~~~~~~~~~~~~~~~~~~~~"
      # client = Ignite::Client.new
      # @retailers = client.query("SELECT * FROM RETAILERS")
      @retailers = Retailer.all
---
SELECT "addresses"."id", "addresses"."name", "addresses"."detail", "addresses"."shopper_id" FROM "addresses" WHERE "addresses"."id" = $1  [["id", 1]]
SELECT "retailers".* FROM "retailers"