app/controllers/categories_controller.rb

  def index
    # client = Ignite::Client.new
    # @categories = client.query("SELECT * FROM CATEGORIES")
    @categories = Category.all
    @cart = Cart.where(shopper_id: Redis.current.get("shopper_id"))
    # @cart = client.query("SELECT * FROM CARTS WHERE SHOPPER_ID = #{Redis.current.get("shopper_id")} AND ORDER_ID = 0")
    puts "~~~~~~~~~~~~~~~~~~~~~~~~#{@cart[0]}  ~~~~~~~~~~~~~~~~~~~~~~~~"
    if(@cart[0] == nil)
      @prods = "Cart is empty"
    else
      @prods = ActiveSupport::JSON.decode("#{@cart[0].products.to_json}")
      # @prods = "#{@cart[0]["ITEMS"]}"
    end
    # @ordersPending = client.query("SELECT * FROM ORDERS WHERE SHOPPER_ID = #{Redis.current.get("shopper_id")} AND STATUS = 1")
    # @ordersCompleted = client.query("SELECT * FROM ORDERS WHERE SHOPPER_ID = #{Redis.current.get("shopper_id")} AND STATUS = 2")
    @ordersPending = Order.where(shopper_id: Redis.current.get("shopper_id"), status: '0')
---
SELECT "categories".* FROM "categories"
SELECT "carts".* FROM "carts" WHERE "carts"."shopper_id" = $1  [["shopper_id", 1]]
SELECT "orders".* FROM "orders" WHERE "orders"."shopper_id" = $1 AND "orders"."status" = $2  [["shopper_id", 1], ["status", 0]]

    def set_category
      @category = Category.find(params[:id])
      # client = Ignite::Client.new
      # @category = client.query("SELECT * FROM CATEGORIES WHERE ID = #{params[:id]}")
      Redis.current.set("category_id","#{@category.id}")
      Redis.current.set("category_name","#{@category.name}")
      # @subcategory = client.query("SELECT * FROM SUBCATEGORIES WHERE CATEGORY_ID = #{Redis.current.get("category_id")}")
      @subcategory = Subcategory.where(category_id: Redis.current.get("category_id"))
      @cart = Cart.where(shopper_id: Redis.current.get("shopper_id"))
      # @cart = client.query("SELECT * FROM CARTS WHERE SHOPPER_ID = #{Redis.current.get("shopper_id")}")
      puts "~~~~~~~~~~~~~~~~~~~~~~~~#{@cart[0]}  ~~~~~~~~~~~~~~~~~~~~~~~~"
      @ordersPending = Order.where(shopper_id: Redis.current.get("shopper_id"), status: '0')
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
SELECT "subcategories".* FROM "subcategories" WHERE "subcategories"."category_id" = $1  [["category_id", 15]]
SELECT "carts".* FROM "carts" WHERE "carts"."shopper_id" = $1  [["shopper_id", 1]]