app/controllers/chats_controller.rb

  def index
    @chats = Chat.all.pluck(:message)
---
SELECT "chats"."message" FROM "chats"

  def new
    @chats = Chat.all.pluck(:message)
---
SELECT "chats"."message" FROM "chats"

  def create
    @chat = Chat.new(chat_params)
    respond_to do |format|
      if @chat.save
---
INSERT INTO "chats" ("message", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["message", "Hello world"], ["created_at", "2022-09-13 07:39:57.151382"], ["updated_at", "2022-09-13 07:39:57.151382"]]