app/controllers/products_controller.rb

  def show
    storage = Google::Cloud::Storage.new(
       project_id: " ID ",
       credentials: "../keyfile.json"
     )

    bucket = storage.bucket " "
      @product = Product.find(params[:id])
---
SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]