app/controllers/retailers_controller.rb

  def show
    # client = Ignite::Client.new
    # @categories = client.query("SELECT * FROM CATEGORIES")
    @categories = Category.all
    @cart = Cart.where(shopper_id: Redis.current.get("shopper_id"))
    if(@cart[0] == nil)
      @prods = "Cart is empty"
    else
      @prods = ActiveSupport::JSON.decode("#{@cart[0].products.to_json}")
    end
    @ordersPending = Order.where(shopper_address: Redis.current.get("address"), status: '0')
---
SELECT "categories".* FROM "categories"
SELECT "carts".* FROM "carts" WHERE "carts"."shopper_id" = $1  [["shopper_id", 1]]
SELECT "orders".* FROM "orders" WHERE "orders"."shopper_address" IS NULL AND "orders"."status" = $1  [["status", 0]]

    def set_retailer
      @retailer = Retailer.find(params[:id])
      Redis.current.set("retailer_id","#{@retailer.id}")
      puts "============== REDIS SAVED RETAILER ID: #{@retailer.id} ==============="
      @categories = Category.all
      @cart = Cart.where(shopper_id: Redis.current.get("shopper_id"))
---
SELECT "retailers".* FROM "retailers" WHERE "retailers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "carts".* FROM "carts" WHERE "carts"."shopper_id" = $1  [["shopper_id", 1]]