app/controllers/subcategories_controller.rb

SELECT "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 15], ["LIMIT", 1]]
SELECT "subcategories".* FROM "subcategories" WHERE "subcategories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "products".* FROM "products" WHERE "products"."subcategory_id" = $1  [["subcategory_id", 1]]
---
    def set_subcategory
      # client = Ignite::Client.new
      # @subcategory = client.query("SELECT * FROM SUBCATEGORIES WHERE ID = #{params[:id]}")
      # Redis.current.set("subcategory_id","#{@subcategory[0]["ID"]}")
      # Redis.current.set("subcategory_name","#{@subcategory[0]["NAME"]}")
      # @product = client.query("SELECT * FROM PRODUCTS WHERE SUBCATEGORY_ID = #{@subcategory[0]["ID"]}")
      @subcategory = Subcategory.find(params[:id])
      Redis.current.set("subcategory_id","#{@subcategory.id}")
      Redis.current.set("subcategory_name","#{@subcategory.name}")
      @product = Product.where(subcategory_id: Redis.current.get("subcategory_id"))
      category = Category.find(Redis.current.get("category_id"))