app/controllers/xyz_controller.rb

SELECT "shoppers"."id", "shoppers"."name", "shoppers"."pass" FROM "shoppers" WHERE "shoppers"."email" = $1  [["email", "umar@gmail.com"]]
SELECT "companies"."id", "companies"."name", "companies"."password_digest" FROM "companies" WHERE "companies"."email" = $1  [["email", "new@gmail.com"]]
SELECT "retailers"."id", "retailers"."name", "retailers"."pass" FROM "retailers" WHERE "retailers"."email" = $1  [["email", "new@gmail.com"]]
---
    def index
        puts " -===================== THIS ONE IS REAL ONE NOT DEVISE ONE =======================- "
        if (shopper = Shopper.where(email:login_params[:email]).pluck(:id, :name, :pass)) != []
            if shopper[0][2] ==  login_params[:password]
                puts"---------------- YES LOGIN IS CALLED USING SHOPPER PARAMS OF #{shopper[0][1]} ---------------"
                Redis.current.mset("shopper_id","#{shopper[0][0]}", "shopper_name","#{shopper[0][1]}", "shopper_email","#{login_params[:email]}")
                puts"=======================REDIS SAVED SHOPPER ID: #{Redis.current.get("shopper_email")}===================="
                # EmailJob.perform_now(1)
                redirect_to '/addresses'
            else
                flash[:login_errors] = ['invaild credentials']
                redirect_to '/'
            end
        elsif (company = Company.where(email:login_params[:email]).pluck(:id, :name, :password_digest)) != []
            if company[0][2] ==  login_params[:password]
                puts"---------------- YES LOGIN IS CALLED USING COMPANY PARAMS OF #{company[0][1]}"
                Redis.current.mset("company_id","#{company[0][0]}", "company_name","#{company[0][1]}", "company_email","#{login_params[:email]}")
                puts"=======================REDIS SAVED COMPANY ID: #{Redis.current.get("company_id")}===================="
                puts"=======================REDIS SAVED COMPANY NAME: #{Redis.current.get("company_name")} \nREDIS SAVED COMPANY EMAIL: #{Redis.current.get("company_email")} ===================="
                # EmailJob.perform_now(1)
                redirect_to '/brands'
            else
               flash[:login_errors] = ['invaild credentials']
               redirect_to '/'
            end
        elsif (retailer = Retailer.where(email:login_params[:email]).pluck(:id, :name, :pass)) != []